run/CollisionBox/constant/SDMpositionsFile
/*--------------------------------*- C++ -*----------------------------------*
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    location    "constant";
    object      positions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
729
(
(36 91 42)
(85 13 31)
(65 33 62)
(32 88 23)
(76 4 74)
(90 91 51)
(43 29 94)
(69 13 60)
(35 27 28)
(25 24 24)
(58 42 98)
(37 2 86)
(60 67 92)
(69 21 32)
(87 15 87)
(94 63 11)
(7 37 81)
(56 58 85)
(25 63 42)
(28 78 36)
(91 76 5)
(3 43 62)
(3 27 32)
(73 77 25)
(64 92 29)
(71 15 50)
(26 94 37)
(86 23 53)
(84 70 9)
(4 86 30)
(50 31 93)
(70 87 17)
(10 76 87)
(75 22 57)
(47 86 25)
(86 56 5)
(94 52 25)
(86 17 34)
(34 68 74)
(94 79 56)
(99 48 11)
(84 84 68)
(37 31 48)
(93 58 84)
(84 12 41)
(96 9 31)
(45 70 13)
(68 40 12)
(17 29 12)
(79 38 90)
(91 56 12)
(11 29 48)
(80 23 76)
(32 90 8)
(21 86 92)
(92 42 38)
(18 93 7)
(82 90 38)
(6 90 68)
(53 45 26)
(2 34 27)
(18 1 58)
(53 68 52)
(2 73 85)
(65 5 84)
(27 37 21)
(56 93 31)
(28 14 23)
(49 88 56)
(59 71 18)
(85 76 84)
(21 10 32)
(30 6 44)
(5 17 65)
(47 27 60)
(97 38 94)
(55 59 45)
(79 86 23)
(70 25 20)
(10 39 71)
(72 20 26)
(45 58 72)
(33 64 92)
(83 24 65)
(25 46 47)
(19 1 89)
(87 2 18)
(53 85 40)
(9 82 60)
(79 24 81)
(89 35 4)
(49 28 88)
(79 80 25)
(46 70 36)
(53 62 55)
(43 30 80)
(97 73 39)
(50 67 15)
...
)